{
  "welcome": "Welcome",
  "pages": {
    "home": "Home",
    "about": "About",
    "contact": "Contact"
  },
  "home": {
    "title": "¡Hi! Im Alan Vasquez, developer web backend",
    "description": "I transform ideas into efficient and scalable digital solutions.\nWith years of experience building robust APIs, clean architectures, and modern web applications,\nI help companies and entrepreneurs take their projects to the next level.\nDo you have an idea or need to optimize your current platform?\nLet's talk\n",
    "secondary": "This is a work in progress, so please bear with me as I continue to improve it."
  },
  "social": {
    "findme": "Find me on",
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "twitter": "Twitter",
    "email": "Email"
  },
  "projects": {
    "title": "Featured Projects",
    "description": "Here is a selection of my most recent and notable projects.",
    "project1": {
      "name": "Project One",
      "description": "Description of Project One."
    },
    "project2": {
      "name": "Project Two",
      "description": "Description of Project Two."
    }
  },
  "mybag": {
    "title": "My skills bag",
    "description": "A collection of my skills and tools I use in my projects.",
    "intro": "I chose to specialize in Vue, Nuxt, Laravel, and Flutter because I was looking for modern, efficient tools with strong communities that enable the development of scalable, high-performance applications across web and mobile. Laravel provides a robust and clean architecture for backend development, while Vue and Nuxt allow me to build dynamic, optimized user interfaces with a great user experience. Flutter, on the other hand, opened the door to cross-platform development with a single codebase. This combination empowers me to deliver fast, comprehensive solutions tailored to the needs of today’s digital landscape.",
    "langstext": "I specialized in JavaScript, PHP, and TypeScript because they are versatile, widely adopted languages with strong ecosystems and powerful frameworks. PHP, especially with Laravel, allows me to build robust and secure backends quickly and elegantly. JavaScript is essential for modern web development and enables me to work on the frontend using frameworks like Vue and Nuxt. TypeScript enhances scalability and maintainability by adding static typing to JavaScript. This combination gives me the flexibility to develop full-stack solutions, both on the server and client sides.",
    "items": [
      {
        "name": "Item One",
        "description": "Description of Item One."
      },
      {
        "name": "Item Two",
        "description": "Description of Item Two."
      }
    ]
  },
  "bookmark": {
    "title": "Mis bookmarks",
    "description": "A collection of useful links and resources that I use in my daily work.",
    "items": [
      {
        "name": "Bookmark One",
        "url": "https://example.com/bookmark1",
        "description": "Description of Bookmark One."
      },
      {
        "name": "Bookmark Two",
        "url": "https://example.com/bookmark2",
        "description": "Description of Bookmark Two."
      }
    ]
  },
  "footer": {
    "rigths": "All rights reserved."
   }
}