{
  "welcome": "Welcome",
  "pages": {
    "home": "Home",
    "about": "About",
    "contact": "Contact"
  },
  "home": {
    "title": "¡Hola! Soy Alan Vasquez, desarrollador web backend",
    "description": "Transformo ideas en soluciones digitales eficientes y escalables.\nCon años de experiencia construyendo APIs robustas, arquitecturas limpias y aplicaciones web modernas, \nayudo a empresas y emprendedores a llevar sus proyectos al siguiente nivel.\n¿Tienes una idea o necesitas optimizar tu plataforma actual? \nHablemos.\n ",
    "secondary": "This is a work in progress, so please bear with me as I continue to improve it."
  },
  "social": {
    "findme": "Encuéntrame en",
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "twitter": "Twitter",
    "email": "Email"
  },
  "projects": {
    "title": "Proyectos Destacados",
    "description": "Aquí hay una selección de mis proyectos más recientes y destacados.",
    "project1": {
      "name": "Proyecto Uno",
      "description": "Descripción del Proyecto Uno."
    },
    "project2": {
      "name": "Proyecto Dos",
      "description": "Descripción del Proyecto Dos."
    }
  },
  "mybag": {
    "title": "Mis habilidades y herramientas",
    "description": "Una colección de mis habilidades y herramientas que utilizo en mis proyectos.",
    "intro": "Me especialicé en Vue, Nuxt, Laravel y Flutter porque buscaba herramientas modernas, eficientes y con comunidades activas que me permitieran crear aplicaciones escalables y de alto rendimiento tanto en web como en móviles. Laravel me brinda una arquitectura robusta y limpia para el backend, mientras que Vue y Nuxt me permiten desarrollar interfaces dinámicas y optimizadas con una gran experiencia de usuario. Flutter, por su parte, me abrió las puertas al desarrollo multiplataforma con una sola base de código. Esta combinación me permite entregar soluciones integrales, rápidas y adaptadas a las necesidades actuales del mercado digital.",
    "langstext": "Me especialicé en JavaScript, PHP y TypeScript porque son lenguajes versátiles, ampliamente adoptados y con un gran ecosistema de herramientas y frameworks. PHP, especialmente con Laravel, me permite construir backends robustos y seguros de forma rápida y elegante. JavaScript es esencial en el desarrollo web moderno y me permite trabajar en el frontend con frameworks como Vue y Nuxt. TypeScript, por su parte, potencia la escalabilidad y mantenibilidad de los proyectos al añadir tipado estático sobre JavaScript. Esta combinación me brinda flexibilidad para desarrollar soluciones completas, tanto del lado del servidor como del cliente.",
    "items": [
      {
        "name": "Item One",
        "description": "Description of Item One."
      },
      {
        "name": "Item Two",
        "description": "Description of Item Two."
      }
    ]
  },
  "footer": {
    "rigths": "Todos los derechos reservados."
   }
}